In [1]:
%pip install jupysql --quiet

     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 95.7/95.7 kB 2.0 MB/s eta 0:00:00
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.9/250.9 kB 11.0 MB/s eta 0:00:00
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 193.0/193.0 kB 19.4 MB/s eta 0:00:00
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 41.3/41.3 kB 4.2 MB/s eta 0:00:00

In [2]:
%load_ext sql

Deploy Streamlit apps for free on Ploomber Cloud! Learn more: https://ploomber.io/s/signup

In [3]:
%%sql sqlite://
CREATE TABLE sales (
  id INT PRIMARY KEY,
  product_name VARCHAR(255),
  category VARCHAR(50),
  sale_date DATE,
  quantity INT,
  amount DECIMAL(10, 2)
);

Connecting to 'sqlite://'

++
||
++
++

In [4]:
%%sql sqlite://
INSERT INTO sales (id, product_name, category, sale_date, quantity, amount)
VALUES
  (1, 'Product A', 'Electronics', '2022-01-01', 10, 500.00),
  (2, 'Product B', 'Clothing', '2022-01-02', 5, 250.50),
  (3, 'Product C', 'Furniture', '2022-01-03', 8, 700.75),
  (4, 'Product A', 'Electronics', '2022-01-04', 12, 600.00),
  (5, 'Product B', 'Clothing', '2022-01-05', 7, 350.25);

5 rows affected.

++
||
++
++

In [6]:
# @title Default title text
%%sql sqlite://
SELECT sum(amount) FROM sales;

+-------------+
| sum(amount) |
+-------------+
|    2401.5   |
+-------------+

Avrage

In [7]:
%%sql sqlite://
SELECT avg(amount) FROM sales;

+-------------+
| avg(amount) |
+-------------+
|    480.3    |
+-------------+

maximum

In [8]:
%%sql sqlite://
SELECT max(amount) FROM sales;

+-------------+
| max(amount) |
+-------------+
|    700.75   |
+-------------+

Minimum

In [9]:
%%sql sqlite://
SELECT MIN(amount) from sales;

+-------------+
| MIN(amount) |
+-------------+
|    250.5    |
+-------------+

# GROUP BY & HAVING CLAUSE

### Group by

In [12]:
# Select total quantity as per Product categorey
%%sql sqlite://
SELECT category , sum(quantity) FROM sales GROUP BY category ;

+-------------+---------------+
|   category  | sum(quantity) |
+-------------+---------------+
|   Clothing  |       12      |
| Electronics |       22      |
|  Furniture  |       8       |
+-------------+---------------+

### Having Clause

In [14]:
%%sql sqlite://
SELECT category , sum(quantity) FROM sales GROUP BY category having sum(quantity) < 10 ;

+-----------+---------------+
|  category | sum(quantity) |
+-----------+---------------+
| Furniture |       8       |
+-----------+---------------+